// CW

// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let num1 = prompt('введіть перше число');
// let num2 = prompt('введіть друге число');
// if (num1 > num2) {
//     console.log(num1);
// } else if (num2>num1) {
//     console.log(num2);
// } else if (num1===num2){
//     console.log('рівні числа');
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let num = prompt('Введіть номер квартири');
// if (20 >= num) {
//     console.log('Обрана квартира в 1');
// } else if ( 49 >= num >= 21){
//     console.log('Обрана квартира в 2');
// } else if (num >= 49){
//     console.log('Обрана квартира в 3');
// } else {
//     console.log('введено неправильне значення')
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let num = +prompt('Введіть числове значення');
// if (num === 10) {
//     console.log('ВІРНО');
// } else {
//     console.log('НЕВІРНО');
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = [1];
// if (typeof x === 'number') {
//     document.write('1');
// } else if (typeof x === "string") {
//     document.write('2');
// } else if (typeof x === 'object') {
//     document.write('3');
// } else if (typeof x === 'boolean') {
//     document.write('4');
// } else {
//     document.write('smthelse');
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let weatherTemp = +prompt('Яка сьогодні температура на вулиці?');
// if (weatherTemp >= 10 && weatherTemp <= 22) {
//     alert('ми йдемо ВЧИТИСЯ');
// } else {
//     alert('сидимо вдома і вчимося ОНЛАЙН');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let lotery = +prompt('Enter the numb 1-5');
// switch (lotery) {
//     case 1:
//         alert('Congratulations ! You won a bike!');
//         break;
//     case 2:
//         alert('Congratulations ! You won a motobike!');
//         break;
//     case 3:
//         alert('Congratulations ! You won a phone!');
//         break;
//     case 4:
//         alert('Congratulations ! You won a PlayStation 5!');
//         break;
//     case 5:
//         alert('Congratulations ! You won a laptop!');
//         break;
//         default:
//             alert ('Your numb is wrong!')
// }

// HW
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let num = +prompt('Введіть число від 1 до 59');
// if (num <= 15) {
//     console.log('Перша четверть')
// } else if (29 >= num) {
//     console.log('Друга четверть')
// } else if (45 >= num) {
//     console.log('Третя четверть')
// } else if (59 >= num) {
//     console.log('Третя четверть')
// } else {
//     console.log('Введено невірне значення')
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = +prompt('Enter the day number from 1 to 31');
// if (day <=10)
//     console.log('now is the first decade of the month')
// else if (day <= 20){
//     console.log('now is the second decade of the month')
// }
// else if (day <= 31){
//     console.log('now is the third decade of the month')
// }

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = 'text';
// if (test === true) {
//     console.log('Вірно')
// }
// else {
//     console.log('Невірно')
// }

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let number = +prompt('Введіть число 1, 0 , -3');
// if (number !== 0){
//     console.log('Вірно')
// }
// else {
//     console.log('Невірно')
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let day = +prompt('Введіть порядковий номер дня тижня');
// switch (day){
//     case 1:
//         alert('Понеділок');
//         break;
//     case 2:
//         alert('Вівторок');
//         break;
//     case 3:
//         alert('Середа');
//         break;
//     case 4:
//         alert('Четвер');
//         break;
//     case 5:
//         alert('Пятниця');
//         break;
//     case 6:
//         alert('Субота');
//         break;
//     case 7:
//         alert('Неділя');
//         break;
//     default:
//             alert ('Your numb is wrong!')
// }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt ('Введите год');
// if(year % 4 === 0){
//     console.log('Год высокосный');
// }
// else {
//     console.log('Год не высокосный');
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let offName = prompt('Яка «офіційна» назва JavaScript?');
// if (offName === 'ECMAScript') {
//     alert('Правильно');
// } else {
//     alert('Не знаєте? ECMAScript!');
// }