// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// let arr = friends.length
// let number = arr >= 3 ? console.log('Великий масив,в якому  3 і більше елементи') : console.log('Це маленький масив, в якому менше 3-х елементів');

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num1 = +prompt('введіть перше число');
// let num2 = +prompt('введіть друге число');
// let num3 = +prompt('введіть третє число');
// if((num2<num1 && num1<num3) || (num3<num1 && num1<num2)) console.log('перше число є середнім');
// if((num1<num2 && num2<num3) || (num3<num2 && num2<num1)) console.log('друге число є середнім');
// if((num1<num3 && num3<num2) || (num2<num3 && num3<num1)) console.log('третє число є середнім');

// - Перепишіть конструкцію if з використанням умовного оператора '?':

// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let res = a+b<4? result = 'Мало':result = 'Багато';


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let ac = +prompt('Введіть число');
// let abc = ac<0? console.log('ви ввели негативне число'): ac>0? console.log('ви ввели позитивне число'): console.log('ви ввели число 0');